package org.example;

public class Task {
    /*
     1 уровень сложности: 1. Создать лист.


В цикле наполнить лист 10 миллионами значений (от 1 до 10000000)

Перебрать лист с помощью for-each, в теле цикла каждое значение листа записать в переменную temp.

Сделать то же самое с помощью классического for.

Сделать то же самое с помощью классического for, но сначала вынести размер листа в отдельную переменную, а потом эту переменную использовать внутри условия цикла.

Сделать то же самое, что и в пункте 5, но перебрать лист с конца до начала.

Сделать то же самое, но используя Iterator.

Сделать то же самое, но используя ListIterator.
Для всех случаев 3-8 замерить время, в течение которого отрабатывает цикл:

Замеряете текущее время до цикла с помощью метода System.currentTimeMillis();

Замеряете текущее время после цикла с помощью метода System.currentTimeMillis();

Выводите разницу во времени после и до в консоль.


Кроме затраченного времени выводить в консоль больше ничего не нужно, т.к. это существенно замедлит работу, смысл эксперимента будет потерян.
Если отрабатывает очень быстро, и разница не особо понятна, попробовать на 100 миллионах значений.
     */
}
